
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 11 to change, 5 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
  * module.pcq-consolidation-fail-action-group-slack-email.azurerm_resource_group_template_deployment.action-group
  * module.pcq-consolidation-service-failures-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.pcq-consolidation-service-summary-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.pcq-consolidation-summary-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.pcq-disposer-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.pcq-disposer-service-failures-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.pcq-disposer-service-summary-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.pcq-disposer-summary-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.pcq-loader-failure-action-group-slack.azurerm_resource_group_template_deployment.action-group
  * module.pcq-loader-service-failure-alert.azurerm_resource_group_template_deployment.custom_alert[0]
* Replace
  * azurerm_key_vault_secret.pcq_storageaccount_primary_access_key
  * azurerm_key_vault_secret.pcq_storageaccount_primary_connection_string
  * azurerm_key_vault_secret.pcq_storageaccount_secondary_access_key
  * azurerm_key_vault_secret.pcq_storageaccount_secondary_connection_string
  * azurerm_key_vault_secret.storage_account_name


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.pcq_key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "pcq_key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "pcq-prod"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + rbac_authorization_enabled      = (known after apply)
      + resource_group_name             = "pcq-prod"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # data.azurerm_key_vault_secret.pcqDisposerSummaryAlertEmail will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "pcqDisposerSummaryAlertEmail" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "pcqDisposerSummaryAlertEmail"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.pcqFailureAlertEmail will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_key_vault_secret" "pcqFailureAlertEmail" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "pcqFailureAlertEmail"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.pcq_storageaccount_primary_access_key must be replaced
-/+ resource "azurerm_key_vault_secret" "pcq_storageaccount_primary_access_key" {
      ~ id                      = "https://pcq-prod.vault.azure.net/secrets/pcq-storage-account-primary-access-key/7ffbe48f87cd4230bdac6c5a31230174" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod" -> (known after apply) # forces replacement
        name                    = "pcq-storage-account-primary-access-key"
      ~ resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod/secrets/pcq-storage-account-primary-access-key/versions/7ffbe48f87cd4230bdac6c5a31230174" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod/secrets/pcq-storage-account-primary-access-key" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "7ffbe48f87cd4230bdac6c5a31230174" -> (known after apply)
      ~ versionless_id          = "https://pcq-prod.vault.azure.net/secrets/pcq-storage-account-primary-access-key" -> (known after apply)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.pcq_storageaccount_primary_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "pcq_storageaccount_primary_connection_string" {
      ~ id                      = "https://pcq-prod.vault.azure.net/secrets/pcq-storage-account-primary-connection-string/95b7e026a6dd4089a8139387efd6760a" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod" -> (known after apply) # forces replacement
        name                    = "pcq-storage-account-primary-connection-string"
      ~ resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod/secrets/pcq-storage-account-primary-connection-string/versions/95b7e026a6dd4089a8139387efd6760a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod/secrets/pcq-storage-account-primary-connection-string" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "95b7e026a6dd4089a8139387efd6760a" -> (known after apply)
      ~ versionless_id          = "https://pcq-prod.vault.azure.net/secrets/pcq-storage-account-primary-connection-string" -> (known after apply)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.pcq_storageaccount_secondary_access_key must be replaced
-/+ resource "azurerm_key_vault_secret" "pcq_storageaccount_secondary_access_key" {
      ~ id                      = "https://pcq-prod.vault.azure.net/secrets/pcq-storage-account-secondary-access-key/098d2369340243b49c9c7486d14d9bb4" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod" -> (known after apply) # forces replacement
        name                    = "pcq-storage-account-secondary-access-key"
      ~ resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod/secrets/pcq-storage-account-secondary-access-key/versions/098d2369340243b49c9c7486d14d9bb4" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod/secrets/pcq-storage-account-secondary-access-key" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "098d2369340243b49c9c7486d14d9bb4" -> (known after apply)
      ~ versionless_id          = "https://pcq-prod.vault.azure.net/secrets/pcq-storage-account-secondary-access-key" -> (known after apply)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.pcq_storageaccount_secondary_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "pcq_storageaccount_secondary_connection_string" {
      ~ id                      = "https://pcq-prod.vault.azure.net/secrets/pcq-storage-account-secondary-connection-string/595267542b6f4e94a17042f426b12a15" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod" -> (known after apply) # forces replacement
        name                    = "pcq-storage-account-secondary-connection-string"
      ~ resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod/secrets/pcq-storage-account-secondary-connection-string/versions/595267542b6f4e94a17042f426b12a15" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod/secrets/pcq-storage-account-secondary-connection-string" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "595267542b6f4e94a17042f426b12a15" -> (known after apply)
      ~ versionless_id          = "https://pcq-prod.vault.azure.net/secrets/pcq-storage-account-secondary-connection-string" -> (known after apply)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.storage_account_name must be replaced
-/+ resource "azurerm_key_vault_secret" "storage_account_name" {
      ~ id                      = "https://pcq-prod.vault.azure.net/secrets/pcq-storage-account-name/73bcb4f13c8645afa47987aa2239bbc8" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod" -> (known after apply) # forces replacement
        name                    = "pcq-storage-account-name"
      ~ resource_id             = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod/secrets/pcq-storage-account-name/versions/73bcb4f13c8645afa47987aa2239bbc8" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.KeyVault/vaults/pcq-prod/secrets/pcq-storage-account-name" -> (known after apply)
      - tags                    = {} -> null
      - value_wo_version        = 0 -> null
      ~ version                 = "73bcb4f13c8645afa47987aa2239bbc8" -> (known after apply)
      ~ versionless_id          = "https://pcq-prod.vault.azure.net/secrets/pcq-storage-account-name" -> (known after apply)
        # (3 unchanged attributes hidden)

      - timeouts {}
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod"
        name       = "pcq-prod"
        tags       = {}
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

  # module.pcq-consolidation-fail-action-group-slack-email.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.Resources/deployments/pcq-alert"
        name                     = "pcq-alert"
      ~ output_content           = jsonencode(
            {
              - actionGroupId = {
                  - type  = "String"
                  - value = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/microsoft.insights/actionGroups/PCQ Consolidation Fail Slack Email Alert - prod"
                }
            }
        ) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.pcq-consolidation-service-failures-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.Resources/deployments/pcq-consolidation-service-prod-failures-alert"
        name                     = "pcq-consolidation-service-prod-failures-alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.pcq-consolidation-service-summary-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.Resources/deployments/pcq-consolidation-service-prod-summary-alert"
        name                     = "pcq-consolidation-service-prod-summary-alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.pcq-consolidation-summary-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.Resources/deployments/pcq-conso"
        name                     = "pcq-conso"
      ~ output_content           = jsonencode(
            {
              - actionGroupId = {
                  - type  = "String"
                  - value = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/microsoft.insights/actionGroups/PCQ Consolidation Summary Slack Alert - prod"
                }
            }
        ) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.pcq-disposer-fail-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.Resources/deployments/pcq-disposer"
        name                     = "pcq-disposer"
      ~ output_content           = jsonencode(
            {
              - actionGroupId = {
                  - type  = "String"
                  - value = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/microsoft.insights/actionGroups/PCQ Disposer Fail Slack Alert - prod"
                }
            }
        ) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.pcq-disposer-service-failures-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.Resources/deployments/pcq-disposer-service-prod-failures-alert"
        name                     = "pcq-disposer-service-prod-failures-alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.pcq-disposer-service-summary-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.Resources/deployments/pcq-disposer-service-prod-summary-alert"
        name                     = "pcq-disposer-service-prod-summary-alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.pcq-disposer-summary-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.Resources/deployments/pcq-sum"
        name                     = "pcq-sum"
      ~ output_content           = jsonencode(
            {
              - actionGroupId = {
                  - type  = "String"
                  - value = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/microsoft.insights/actionGroups/PCQ Disposer Summary Slack Alert - prod"
                }
            }
        ) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.pcq-loader-failure-action-group-slack.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.Resources/deployments/pcq-loader"
        name                     = "pcq-loader"
      ~ output_content           = jsonencode(
            {
              - actionGroupId = {
                  - type  = "String"
                  - value = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/microsoft.insights/actionGroups/PCQ Loader Failure Slack Alert - prod"
                }
            }
        ) -> (known after apply)
      ~ parameters_content       = (sensitive value)
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ outputs        = {
                  ~ actionGroupId = {
                      ~ type  = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                }
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.pcq-loader-service-failure-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/pcq-prod/providers/Microsoft.Resources/deployments/pcq-loader-service-prod-failure-alert"
        name                     = "pcq-loader-service-prod-failure-alert"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

Plan: 5 to add, 11 to change, 5 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":165,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->